{// ============================================================================
// Модуль: NosoClient
// Опис:    Даний модуль оголошує юніт NosoClient для роботи з клієнтською
//          частиною мережі Noso. Містить підключення основних бібліотек для
//          роботи з TCP-клієнтом та мережевими контекстами.
// Автор:   [Вкажіть автора]
// Дата:    [Вкажіть дату створення]
// ============================================================================
//
// Підключені модулі:
//   - Classes, SysUtils: базові модулі для роботи з класами та системними утилітами.
//   - IdContext, IdGlobal, IdTCPClient: модулі бібліотеки Indy для роботи з TCP-клієнтом.
//
// Призначення:
//   Даний юніт слугує основою для реалізації клієнтської логіки взаємодії з мережею Noso.
//
// Примітка:
//   Реалізація функціоналу буде додана у секції IMPLEMENTATION.
//
// ============================================================================}
unit NosoClient;

{$mode ObjFPC}{$H+}

INTERFACE

uses
  Classes, SysUtils,
  IdContext, IdGlobal, IdTCPClient;

IMPLEMENTATION

END. // End unit

